intrinsic-function/process-algebra.tex
% Created 2023-03-28 Tue 20:38
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,oneside,x11names]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{bm}
\usepackage[T1]{fontenc}
\usepackage{cmll}
\usepackage{amsmath}
\usepackage{amsthm}
\usepackage{amssymb}
\usepackage{interval}  % must install texlive-full
\usepackage{mathtools}
\usepackage{interval}  % must install texlive-full
\usepackage[shortcuts]{extdash}
\usepackage{tikz}
\usepackage[utf8]{inputenc}
\usepackage[top=1.25in,bottom=1.25in,left=1.75in,right=1.75in,includefoot]{geometry}
\usepackage{palatino}
\usepackage{siunitx}
\usepackage{braket}
\usepackage[euler-digits,euler-hat-accent]{eulervm}
\usepackage{fancyhdr}
\pagestyle{fancyplain}
\lhead{}
\chead{\textbf{(c) Brian Beckman, 2023; Creative Commons Attribution-ShareAlike CC-BY-SA}}
\rhead{}
\lfoot{(c) Brian Beckman, 2023; CC-BY-SA}
\cfoot{\thepage}
\rfoot{}
\usepackage{lineno}
\usepackage{minted}
\usepackage{listings}
\usepackage{tipa}
\usepackage{parskip}
\setlength{\parindent}{15pt}
\usepackage{listings}
\usepackage{xcolor}
\usepackage{textcomp}
\usepackage[atend]{bookmark}
\usepackage{mdframed}
\usepackage[utf8]{inputenc} % usually not needed (loaded by default)
\usepackage[T1]{fontenc}
\newcommand\definedas{\stackrel{\text{\tiny def}}{=}}
\newcommand\belex{BELEX}
\newcommand\bleir{BLEIR}
\newcommand\llb{low-level \belex}
\newcommand\hlb{high-level \belex}
\newcommand{\Coloneqq}{\mathrel{\vcenter{\hbox{$:\,:\,=$}}{}}}
\newcommand\napping    [0]{0}
\newcommand\chatting   [3]{\bar{#1}\langle{#2}\rangle{}.\,#3}
\newcommand\listening  [3]{#1(#2).\,#3}
\newcommand\two        [2]{#1\mathrel{\vert}{#2}}
\newcommand\whispering [2]{(\nu\,#1)\,{#2}}
\newcommand\mama       [1]{!\,{#1}}
\newcommand{\kitOne}{\chatting{x}{z}{\napping}}
\newcommand{\kitTwo}{\listening{x}{y}{\chatting{y}{x}{\listening{x}{y}{\napping}}}}
\newcommand{\kitThree}{\listening{z}{v}{\chatting{v}{v}{\napping}}}
\newcommand{\wkit}{\whispering{x}{P}}
\newcommand{\kitTwoSuffix}{\chatting{y}{x}{\cdots}}
\newcommand{\kitTwoSuffixx}{\chatting{y}{x}{\listening{x}{y}{\napping}}}
\newcommand{\kitTwoHearSuffix}{\listening{x}{y}{\napping}}
\theoremstyle{definition}
\newtheorem{definition}{Definition}
\theoremstyle{warning}
\newtheorem{warning}{Warning}
\newcommand\say [3]{\left(\texttt{say}\thickspace{}#1\thickspace{}#2\thickspace{}#3\right)}
\newcommand\hear[3]{\left(\texttt{hear}\thickspace{}#1\thickspace{}#2\thickspace{}#3\right)}
\newcommand\kitA{\say{x}{z}{\napping}}
\newcommand\kitB{\hear{x}{y}{\say{y}{x}{\hear{x}{y}{\napping}}}}
\newcommand\kitC{\hear{z}{v}{\say{v}{v}{\napping}}}
\newcommand\knapping    [0]{\texttt{(nap)}}
\newcommand\kpar        [2]{\texttt{(par}\thickspace{}#1\thickspace{}#2\texttt{)}}
\newcommand\kwhispering [2]{\texttt{(channel}\thickspace{}#1\thickspace{}#2\texttt{)}}
\newcommand\kmama       [1]{\texttt{(repeat}\thickspace{}#1\texttt{)}}
\BeforeBeginEnvironment{minted}{\begin{mdframed}}
\AfterEndEnvironment{minted}{\end{mdframed}}
\bookmarksetup{open, openlevel=2, numbered}
\DeclareUnicodeCharacter{03BB}{$\lambda$}
\author{Brian Beckman}
\date{24 Mar 2023}
\title{Concurrent Kittens in Little Boats}
\hypersetup{
 pdfauthor={Brian Beckman},
 pdftitle={Concurrent Kittens in Little Boats},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 of 2019-04-12, org version: 9.2.2},
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\setlength\parindent{0pt}

\clearpage
\section{Prologue}
\label{sec:org8710f9e}

I must confess a mild mental disability: when I see
mathematics or programs, I see drowning kittens, and I want to save them.

\texttt{1+2*3}, five little kittens drowning in the sea.
Venus-the-boatwright rises on her half-shell, fists full of bows
and sterns. She reaches down and builds little boats, each from a
bow and a stern. She puts some little kittens in each boat.
Sometimes, she puts another little boat in a boat in place of a
kitten.

She kisses the first kitten (or boat) in each boat and says
``You're the captain; take care of the others!'' She blesses the
little boats and sinks back into the sea, leaving \texttt{(+ 1 (* 2 3))}
sailing safely on the waves.

Have you been burnt by C code like \texttt{x | y \& z} or \texttt{x / y * z}?
Perhaps you can dream, like me, of saving the drowning kittens.
Wright the boats in drydock\footnote{compiled ahead-of-time (AOT)} or
asea\footnote{interpreted or compiled just-in-time (JIT)}, right
the boats so they float,\footnote{type-check and optimize} and write
\texttt{(\& z (| x y))} and \texttt{(* z (/ x y))}! If not, perhaps you can
tolerate me. My affliction is not my fault! It is like
misophonia.\footnote{\url{https://www.webmd.com/mental-health/what-is-misophonia}}:
built-in, incurable, inexplicable (except to fellow
sufferers).\footnote{Plus, I don't like writing parsers: it's boring.}

\subsection{``What are you doing?''}
\label{sec:org766714c}

Let's implement some fundamental terms from the rho calculus\footnote{Meredith, L. G.; Radestock, Mattias (22 December 2005). ``A Reflective Higher-Order Calculus''. Electronic Notes in Theoretical Computer Science. 141 (5): 49–67. \url{https://doi.org/10.1016/j.entcs.2005.05.016}.}
and the pi calculus\footnote{\url{https://en.wikipedia.org/wiki/\%CE\%A0-calculus}\label{org84b0e5f}}
in a DSL\footnote{\url{https://en.wikipedia.org/wiki/Domain-specific\_language}}
made of little boats, meaning ``embedded in Clojure.'' Asynchronous
behavior is easy to model in Clojure, and we have
\texttt{clojure.spec}\footnote{\url{https://clojure.org/guides/spec}} for type
checking. Plus Clojure looks like little boats to save
the drowning kittens. It's important for programs to look good.
Mathematics and programming \emph{are visual arts}.
