intrinsic-function/process-algebra.org
** "Why not RhoLang?"

You call up your friend Nancy and invite her to a party at your
house. She asks "Will Ted be there?" You think to yourself
/what fun!/ and innocently say, "Yes, I think so! I invited him!"
Nancy says "I'm terribly sorry, but I won't be able to make it to
your party. Please have a great time and give my best to
everyone!" Nancy hangs up and thinks to herself /except to Ted/.

Ted's last name is Scala.

Let's compromise. Nancy won't ever see Scala again, plus she can't
stand to see kittens drowning, i.e., implicit precedence rules.
Otherwise she likes RhoLang. Let's create something with the same
semantics as RhoLang embedded in Clojure, and call it CrowLang.

Perhaps CrowLang can inter-operate with RhoLang. They're both on
the Java Virtual Machine, after all. Or perhaps we'll write new
lcompilers[fn:lcompilers: https://github.com/lcompilers] [\textit{sic}]
for CrowLang and RhoLang (you can write an lcompiler for Scala, Nancy
doesn't care). Lcompilers are fast, flexible, modularized, and
easy to write. In fact, some day, lcompilers will use rho and pi
for internal type-checking and other formalisms!

** "Why not something better?"

Considered and rejected:

- Agda :: --- too obscure

- Haskell or Mathematica :: --- I think Mathematica is my all-time
  favorite programming language. Sadly, no one else will use it.
  Haskell is in my top-five favorites, rejected for the same reason.

- Python :: --- well, ok, umm, never mind, no

- Common Lisp :: --- not modern, otherwise fantastic!

- Racket :: --- designed for DSLs after all, but no one else uses it

- Coq :: --- full of rabbit holes, otherwise lovely!

- C++ :: --- I would drive us both crazy.

There /is/ a path of least resistance for me, considering all
things.

** "Clojure doesn't have types!"

Not so. Clojure.spec[fn:: https://clojure.org/guides/spec] is at
least as strong as types. It's not static, that's true, but
=s/conform= /could/ be static.

Static or not hardly matters in our case. We can build little
boats in drydock before setting sail, or Venus-the-boatwright will
build them at sea for us. We can check types, we can do rewriting,
we can prove theorems. It's good enough.

Also, Clojure is already in our toolchain. We use it for abstract
interpretation and test generation[fn:: https://github.com/rebcabin/asr-tester]
for lfortran and lpython.[fn:lcompilers]

** "How did you write this?"

This is an executable document. When I produce a PDF from it, all
code blocks are executed and results reported. I like this better
than Jupyter notebooks for many reasons. This document
is an instance of Knuth's literate programming[fn::
https://en.wikipedia.org/wiki/Literate_programming] in
org-babel.[fn:: https://orgmode.org/worg/org-contrib/babel/]

# , not least because I can
# define things in any order, say /after/ I use them. This document
# is an instance of Knuth's literate programming[fn::
# https://en.wikipedia.org/wiki/Literate_programming]. in
# org-babel.[fn:: https://orgmode.org/worg/org-contrib/babel/]

\newpage
* $\Pi$ Kittens in Little Boats

From the wiki page:[fn:PI]

#+LaTeX_HEADER: \newcommand\napping    [0]{0}
#+LaTeX_HEADER: \newcommand\chatting   [3]{\bar{#1}\langle{#2}\rangle{}.\,#3}
#+LaTeX_HEADER: \newcommand\listening  [3]{#1(#2).\,#3}
#+LaTeX_HEADER: \newcommand\two        [2]{#1\mathrel{\vert}{#2}}
#+LaTeX_HEADER: \newcommand\whispering [2]{(\nu\,#1)\,{#2}}
#+LaTeX_HEADER: \newcommand\mama       [1]{!\,{#1}}

#+begin_export latex
\begin{equation}
\begin{array}{clll}
  P, Q & \Coloneqq \\
       & | \quad \napping            & \textrm{napping kitten}    & \textrm{Do nothing; halt.}                                    \\
       & | \quad \listening{x}{y}{P} & \textrm{listening kitten}  & \textrm{Listen on channel }x\textrm{ for channel }y\textrm{.} \\
       & | \quad \chatting{x}{y}{P}  & \textrm{chatting kitten}   & \textrm{Say "}y\textrm{" on channel }x\textrm{; don't wait.}  \\
       & | \quad \two{P}{Q}          & \textrm{two kittens}       & \textrm{Run }P\textrm{ and }Q\textrm{ in parallel.}           \\
       & | \quad \whispering{x}{P}   & \textrm{whispering kitten} & \textrm{fresh channel name }x\textrm{; Use it in }P\textrm{.} \\
       & | \quad \mama{P}            & \textrm{mama cat}          & \textrm{Run copies of }P\textrm{ forever.} \\
\end{array}
\end{equation}
#+end_export

This pi calculus is-low-level, like $\lambda$ calculus, only with
concurrency added. We'd have to build up numbers (like Church
numerals), Booleans, sets, functions, conditionals, loops,
everything. We'll do a little better, later. First, let's save
some drowning kittens!

