intrinsic-function/process-algebra.tex

\subsection{``Why not RhoLang?''}
\label{sec:orgc2be556}

You call up your friend Nancy and invite her to a party at your
house. She asks ``Will Ted be there?'' You think to yourself
\emph{what fun!} and innocently say, ``Yes, I think so! I invited him!''
Nancy says ``I'm terribly sorry, but I won't be able to make it to
your party. Please have a great time and give my best to
everyone!'' Nancy hangs up and thinks to herself \emph{except to Ted}.

Ted's last name is Scala.

Let's compromise. Nancy won't ever see Scala again, plus she can't
stand to see kittens drowning, i.e., implicit precedence rules.
Otherwise she likes RhoLang. Let's create something with the same
semantics as RhoLang embedded in Clojure, and call it CrowLang.

Perhaps CrowLang can inter-operate with RhoLang. They're both on
the Java Virtual Machine, after all. Or perhaps we'll write new
lcompilers\footnote{\url{https://github.com/lcompilers}\label{org689557b}} [\textit{sic}]
for CrowLang and RhoLang (you can write an lcompiler for Scala, Nancy
doesn't care). Lcompilers are fast, flexible, modularized, and
easy to write. In fact, some day, lcompilers will use rho and pi
for internal type-checking and other formalisms!

\subsection{``Why not something better?''}
\label{sec:orgd9bea58}

Considered and rejected:

\begin{description}
\item[{Agda}] --- too obscure

\item[{Haskell or Mathematica}] --- I think Mathematica is my all-time
favorite programming language. Sadly, no one else will use it.
Haskell is in my top-five favorites, rejected for the same reason.

\item[{Python}] --- well, ok, umm, never mind, no

\item[{Common Lisp}] --- not modern, otherwise fantastic!

\item[{Racket}] --- designed for DSLs after all, but no one else uses it

\item[{Coq}] --- full of rabbit holes, otherwise lovely!

\item[{C++}] --- I would drive us both crazy.
\end{description}

There \emph{is} a path of least resistance for me, considering all
things.

\subsection{``Clojure doesn't have types!''}
\label{sec:org3d0b0d2}

Not so. Clojure.spec\footnote{\url{https://clojure.org/guides/spec}} is at
least as strong as types. It's not static, that's true, but
\texttt{s/conform} \emph{could} be static.

Static or not hardly matters in our case. We can build little
boats in drydock before setting sail, or Venus-the-boatwright will
build them at sea for us. We can check types, we can do rewriting,
we can prove theorems. It's good enough.

Also, Clojure is already in our toolchain. We use it for abstract
interpretation and test generation\footnote{\url{https://github.com/rebcabin/asr-tester}}
for lfortran and lpython.\textsuperscript{\ref{org689557b}}

\subsection{``How did you write this?''}
\label{sec:orgc0b6a1e}

This is an executable document. When I produce a PDF from it, all
code blocks are executed and results reported. I like this better
than Jupyter notebooks for many reasons. This document
is an instance of Knuth's literate programming\footnote{\url{https://en.wikipedia.org/wiki/Literate\_programming}} in
org-babel.\footnote{\url{https://orgmode.org/worg/org-contrib/babel/}}

\newpage
\section{\(\Pi\) Kittens in Little Boats}
\label{sec:org5ebd3be}

From the wiki page:\textsuperscript{\ref{org84b0e5f}}

\begin{equation}
\begin{array}{clll}
  P, Q & \Coloneqq \\
       & | \quad \napping            & \textrm{napping kitten}    & \textrm{Do nothing; halt.}                                    \\
       & | \quad \listening{x}{y}{P} & \textrm{listening kitten}  & \textrm{Listen on channel }x\textrm{ for channel }y\textrm{.} \\
       & | \quad \chatting{x}{y}{P}  & \textrm{chatting kitten}   & \textrm{Say "}y\textrm{" on channel }x\textrm{; don't wait.}  \\
       & | \quad \two{P}{Q}          & \textrm{two kittens}       & \textrm{Run }P\textrm{ and }Q\textrm{ in parallel.}           \\
       & | \quad \whispering{x}{P}   & \textrm{whispering kitten} & \textrm{fresh channel name }x\textrm{; Use it in }P\textrm{.} \\
       & | \quad \mama{P}            & \textrm{mama cat}          & \textrm{Run copies of }P\textrm{ forever.} \\
\end{array}
\end{equation}

This pi calculus is-low-level, like \(\lambda\) calculus, only with
concurrency added. We'd have to build up numbers (like Church
numerals), Booleans, sets, functions, conditionals, loops,
everything. We'll do a little better, later. First, let's save
some drowning kittens!
