intrinsic-function/process-algebra.org
** A Cartoon

Here is a tiny calculation cartoon, again from the wiki page,
showing a reduction similar to an \eta\nobreakdash-reduction in
\lambda calculus:

#+LaTeX_HEADER: \newcommand{\kitOne}{\chatting{x}{z}{\napping}}
#+LaTeX_HEADER: \newcommand{\kitTwo}{\listening{x}{y}{\chatting{y}{x}{\listening{x}{y}{\napping}}}}
#+LaTeX_HEADER: \newcommand{\kitThree}{\listening{z}{v}{\chatting{v}{v}{\napping}}}

#+begin_export latex
\begin{equation}
\begin{array}{clll}
  (\nu\,x) & (      & \kitOne \\
           & \vert  & \kitTwo \\
           & \vert  & \kitThree \\
       {}  & )
\end{array}
\end{equation}
#+end_export

#+LaTeX_HEADER: \newcommand{\wkit}{\whispering{x}{P}}

We have four drowning kittens. Kitten Zero is a whispering
kitten $\wkit$. She whispers "$x$" to the other kittens,
meaning "let's talk on channel $x$!" One might write:

#+begin_export latex
\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \kitOne \\
 \vert  & \kitTwo \\
 \vert  & \kitThree \\
\end{array}\right)}
\end{equation}
#+end_export

Kitten Zero is obviously going to be the captain of a boat
containing the remaining kittens, but we've only just started to
wright boats.

#+begin_quote
/We'll say "kitten" and mean "an actual kitten, or a little boat
containing kittens or more little boats." Each little boat contains zero-or-more kittens and zero-or-more more littler boats./
#+end_quote

One of the three remaining kittens is chatting on channel $x$ and
the other two are listening, one on $x$ and the other on $z$.
These three are doing their things two at a time,
$\two{P}{(\two{Q}{R})}$ or $\two{(\two{P}{Q})}{R}$, it doesn't
matter how you think about it (/associativity of/ par).[fn:: A
better /par/ boat could hold any number of kittens, in any order.
We'll get there.]

Kitten One, $\kitOne$, chats on $x$, "Hey, let's continue chatting
on $z$!" Then she takes a nap. Only one of the other kittens,
Kitten Two, $\kitTwo$, listens on $x$.[fn:: If more than one
kitten listens on the same channel, we have a classic race
condition. A compiler can detect this directly from the syntax of
the program! At run time, only one will hear and the other will
starve, at least for a while.] She thinks, "Oy! Here I am waiting
on $x$ for someone to tell me where (on what channel) to continue,
and I just heard 'continue on $z$,' so I'll switch to $z$. After I
switch, I'll have something to say, but just let me switch,
first!"

#+begin_export latex
\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \kitOne \\
 {}     & \parallel \hspace{4.5pt} \downarrow \\
 \vert  & \kitTwo \\
 {}     & \hspace{9.5pt}\downarrow\hspace{8.5pt}\downarrow \\
 \vert  & \listening{x}{z}{\chatting{z}{x}{\listening{x}{y}{\napping}}} \\
 \vert  & \kitThree \\
\end{array}\right)}
\end{equation}
#+end_export

#+LaTeX_HEADER: \newcommand{\kitTwoSuffix}{\chatting{y}{x}{\cdots}}
#+LaTeX_HEADER: \newcommand{\kitTwoSuffixx}{\chatting{y}{x}{\listening{x}{y}{\napping}}}

The out-channel $\bar{x}$ of Kitten One matches the in-channel $x$
of Kitten Two; Kitten One said something and Kitten Two heard it.
The /say-prefix/, $\bar{x}\langle{}z\rangle$, before the dot of
Kitten One, $\kitOne$, gets gobbled up, and Kitten One takes a
nap. The /hear-prefix/, $x(y)$, before Kitten Two's first dot, the
first dot of $\kitTwo$, also gets gobbled up. Plus, $y$ changes to
$z$ in the next say-prefix, $\bar{y}\langle{x}\rangle$, of Kitten
Two's first suffix, $\kitTwoSuffixx$:

#+begin_export latex
\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \napping  \\
 \vert  & \chatting{z}{x}{\listening{x}{y}{\napping}} \\
 \vert  & \listening{z}{v}{\chatting{v}{v}{\napping}} \\
\end{array}\right)}
\end{equation}
#+end_export

This is rather like the substitution of actual arguments for
formal parameters in a function call in an ordinary programming
language.

** Free and Bound

#+LaTeX_HEADER: \newcommand{\kitTwoHearSuffix}{\listening{x}{y}{\napping}}

Before this substitution of $z$ for $y$, the $y$ in Kitten Two's
next say-prefix, $\bar{y}\langle{x}\rangle$, is /free/. That means
it must change to $z$. However, the second $y$ in Kitten Two's
first suffix, $\kitTwoSuffixx$, isn't free. The $y$ in $x(y)$
doesn't change to $z$ because that $y$ is /local/ to the final
suffix, $0$, of $\kitTwoHearSuffix$. If that that suffix had more
to do, the name $y$ would be unconnected to the earlier
appearances of $y$. In this case, the suffix takes a nap, so we
don't have to worry.

/Bound/ is a synonym for /not free/. A variable $y$ is either free
or bound in a prefix, $(\nu\,x)$, $\bar{y}\langle{x}\rangle$, or
$x(y)$. It can't be both except in the one strange case $x(x)$.
Once it's bound, it's bound in all the suffixes to the right; $y$
would be bound in the suffixes, $P.Q.\cdots$, of
$\listening{x}{y}{P.Q.\cdots}$, at least up until the next
binding. Any re-bindings of $y$ in a long suffix $P.Q.\cdots$
pertain to the closest binding, looking leftward. That closest
binding must be a whispering kitten or a listening kitten.

\newpage
** Binding

There are only two ways to bind a name; only two /binding prefix forms/:

- whispering :: --- $\whispering{x}{P}$ binds $x$ in its suffixes
  $P$, up until the next binding.

- listening :: --- $\listening{x}{y}{Q}$ binds $y$ in its suffixes
  $Q$, up until the next binding.

#+LaTeX_HEADER: \theoremstyle{definition}
#+LaTeX_HEADER: \newtheorem{definition}{Definition}

#+LaTeX_HEADER: \theoremstyle{warning}
#+LaTeX_HEADER: \newtheorem{warning}{Warning}

\label{def:binding}
\begin{definition}{\emph{binding, scope:}}
  Each binding of a given name, say $y$, pertains to the entire
  suffix of its binding form, up until the next binding of $y$.
  That new binding
  \emph{shadows} the prior binding. This is like  the
  \emph{environment model} or \emph{lexical binding} of an
  ordinary programming language.
  A sequence of binding prefixes describes a right-hugging
  nest of \emph{scopes} in which the bound variable have known values.
  $\blacksquare$
\end{definition}

We don't yet know /bound to what/? We can only find out later when
a hear-prefix lines up with a say-prefix again. So this usage of
the word /bound/ means /eventually bound to something/. The term
/bound/ by itself can be ambiguous, because we might also say
/bound/ when we /do/ know /bound to what/.

** Substitution

We can state a general rule for /substitution/, with some
terminology to be clarified:

\label{def:substitution}
\begin{definition}{\emph{substitution}:}
  When the channel $x$ of a left-most say-prefix, $\bar{x}\langle{z}\rangle$,
  equals the channel $x$ of a left-most hear-prefix, $x(y)$, the prefixes
  are gobbled up and all free occurrences of $y$ on the
  right of the hear-prefix suffer substitution of $z$ for $y$.
  $\blacksquare$
\end{definition}

** Renaming

What if there were already some $z$'s amongst the free $y$'s? The
listening kitten would have to patch that up first. It doesn't
matter what temporary bound name she gives to a channel, so long
as the same channel has the same bound name everywhere in some
suffixes, to the right of some dot or some whisper. We might
rename preexisting $z$'s something like $z_1$. That's /alpha
renaming/. We don't have that problem here, but we might later.
Our kittens always remember their sailorly duty to clean up messes
in their boats.

\label{def:renaming}
\begin{definition}{\emph{renaming}:}
  Prior to substitution of $z$ for a free variable $y$ in the suffixes of
  a hear-prefix,
  any bound occurrences of $z$ to the right of the hear-prefix must be
  renamed consistently lest they collide with the incoming $z$
  that replaces $y$. $\blacksquare$
\end{definition}

Renaming in the suffixes happens first, then substitution happens
to the free variables.

** Animated Cartoons

I can't animate cartoons in a paper, but I visualize calculations
as symbols moving around in an animated cartoon (please forgive
another related mental afflictions, synaesthesia). It saves me
mistakes. I animate calculations with pen and paper.

