intrinsic-function/process-algebra.tex

\subsection{Finishing Up}
\label{sec:org6c09a0a}

Kitten Two, \(\chatting{z}{x}{\listening{x}{z}{\napping}}\), now
says on \(z\) ``Switch to \(x\), will you?'' to whomever is listening.
Then she waits and listens on \(x\). Kitten Three, \(\kitThree\), is
listening on \(z\) for a channel.  She temporarily calls that channel
\(v\), but now she knows that \(v\) is really \(x\):

\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \napping  \\
 \vert  & {\listening{x}{z}{\napping}} \\
 \vert  & {\chatting{x}{x}{\napping}} \\
\end{array}\right)}
\end{equation}

See how the \(z\) chat-listen pair got gobbled up and how \(x\) got
substituted for \(v\)? If not, do an animation on paper. Kitten
Three didn't have to patch up any lingering \(x\)'s, but she
remembers to check.

Kitten Three says ``\(x\)'' on \(x\) and takes a nap without waiting.
Kitten Two hears on \(x\) that her temporary channel name \(z\) really
should be \(x\) again. She changes her \(z\) to \(x\), notices she
doesn't have any patching up or anything else to do, and takes a
nap. If you don't see it in your mind's eye, animate it on paper.

\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \napping   \\
 \vert  & {\napping} \\
 \vert  & {\napping} \\
\end{array}\right)}
\end{equation}

All the kittens are napping safely in the whisperer's boat.

\subsection{All Names are Channels}
\label{sec:org2ea80cb}

Every variable, \(x\), \(y\), \(z\), \(v\), stands in for a communication
channel. Sometimes we know what channel a variable stands for, say
after substitution. Other times, a variable stands for a channel
we'll find out about later. That's all we have so far: channels,
known or unknown.

\subsection{Bail the Boats!}
\label{sec:orgb4bd1e8}

For now, we've got all kittens safely napping in the ``whisper''
boat. But they're not \emph{dry}. They had to bail out a \emph{lot} of water
to keep from drowning whilst Venus-the-boatwright was working.
Venus will fix that with some little boats \emph{inside} other boats,
including the biggest ``whisper'' boat.

Venus first bails out most of the water, leaving little skeletal,
boats-in-progress --- ordinary mathematical function notation:

\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \texttt{say} (x, z, \napping) \\
 \vert  & \texttt{hear}(x, y, \texttt{say}(y, x, \texttt{hear}(x, y, \napping))) \\
 \vert  & \texttt{hear}(z, v, \texttt{say}(v, v, \napping))
\end{array}\right)}
\end{equation}

There is still too much water (syntactic noise), and some kittens
still aren't inside boats! Venus! Finish the boats:

\begin{equation}
\whispering{x}{\left(
\begin{array}{clll}
 {}     & \kitA \\
 \vert  & \kitB \\
 \vert  & \kitC \\
\end{array}\right)}
\end{equation}

Venus! You're not done! Everything must be a kitten or a boat!

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x
  (par (say x z 0)
       (par (hear x y
              (say y x
                (hear x y 0)))
            (hear z v
             (say v v 0)))))
\end{minted}

Hooray, all the kittens are safe and dry! But they can't nap, yet.
Venus! Rearrange the boats so kittens can chat and then nap!

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x
  (par (par (say  x z 0)  ;; Oooh!, x's line up!
            (hear x y
                  (say y x
                       (hear x y 0))))
       (hear z v
             (say v v 0))))
\end{minted}

This is great because we have a rule that says whenever a \texttt{say}
and a \texttt{hear} line up their channels, we can rename, substitute and
gobble up one \texttt{say} and its matching \texttt{hear}:

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x
  (par (par 0
            (say z x
                 (hear x z 0)))
       (hear z v
             (say v v 0))))
\end{minted}

Darn it! Venus! Rearrange the \texttt{par}'s again, (it's always OK to do
that):

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x
  (par 0
       (par (say  z x (hear x z 0))
            (hear z v (say v v 0)))))
\end{minted}

Substitute and gobble:

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x
  (par 0
       (par (hear x z 0)
            (say  x x 0))))
\end{minted}

One more time:

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x
  (par 0 (par 0 0)))
\end{minted}

Inside a \texttt{par} boat, it doesn't matter whether you write \texttt{hear}
before \texttt{say} or \texttt{say} before \texttt{hear} --- \texttt{par} is commutative.
Also, because any number of napping kittens in \texttt{par}'s is
equivalent to a big napping kitten, we see

\vskip 0.26cm
\begin{minted}[]{clojure}
(channel x 0)
\end{minted}

Finally, because there is nothing to do with channel \(x\), The
whispering kitten can nap, too.

\vskip 0.26cm
\begin{minted}[]{clojure}
0
\end{minted}

Thanks, Venus!

\subsection{Kitten Boat Grammar}
\label{sec:org35988c7}

This is what Venus-the-boatwright had in mind whilst she built:

\begin{equation}
\begin{array}{clll}
  K, L & \Coloneqq \\
       & | \quad \knapping            & \textrm{napping kitten}    & \textrm{Do nothing; halt.}                                   \\
       & | \quad \hear{x}{y}{K}       & \textrm{listening kitten}  & \textrm{Listen on channel }x\textrm{ for channel }y.         \\
       & | \quad \say{x}{y}{K}        & \textrm{chatting kitten}   & \textrm{Say "}y\textrm{" on channel }x\textrm{; don't wait.} \\
       & | \quad \kpar{K}{L}          & \textrm{two kittens}       & \textrm{Run }K\textrm{ and }L\textrm{ in parallel.}          \\
       & | \quad \kwhispering{x}{K}   & \textrm{whispering kitten} & \textrm{fresh channel name }x\textrm{; use it in }K\textrm{.}\\
       & | \quad \kmama{K}            & \textrm{mama cat}          & \textrm{run copies of }K\textrm{ forever}\textrm{.}          \\
\end{array}
\end{equation}

\newpage
\section{Channels and Names}
\label{sec:org5246fce}

Our kittens are Kitten One, Kitten Two, and Kitten Three. These
aren't names in kitten-speak, not names for channels like \(x\) and
\(y\). These are names in boat-speak, just so we don't have to keep
writing out the full boats each time.

Let's run some real code! For technical reasons, we need some
punctuation --- dots and quote marks here and there --- when we
write out kittens in Clojure. We'll explain later.
