intrinsic-function/process-algebra.tex

\subsection{Kit-1}
\label{sec:orga3e51ae}

\vskip 0.26cm
\begin{minted}[]{clojure}
(def kit-1
  (say. 'x 'z (nap.)))
\end{minted}

Notice that when \texttt{kit-1} takes a nap, she's not saying or hearing
anything. \emph{The free names of \texttt{(nap)}, the names subject to
substitution, are the empty set}:

\vskip 0.26cm
\begin{minted}[]{clojure}
(free-names (nap.))
\end{minted}

\begin{verbatim}
#{}
\end{verbatim}


In fact, the names that \texttt{kit-1} will eventually know about while
napping, the \emph{bound names, subject to renaming}, are also the
empty set:

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names (nap.))
\end{minted}

\begin{verbatim}
#{}
\end{verbatim}


Before she naps, Kitten One says \(z\) on \(x\), so both those names
are free for \texttt{kit-1}, meaning she just barks them out. They don't
stand for anything else:

\vskip 0.26cm
\begin{minted}[]{clojure}
(free-names kit-1)
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}


\texttt{Kit-1} doesn't wait for any names before she's napping, so her
\emph{bound names} are the empty set:

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names kit-1)
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}


\newpage
\subsection{Kit-2}
\label{sec:org0d553b9}

Kitten Two listens on \(x\) for bound \(y\), then says, on whatever
\(y\) becomes, ``\(x\)''.

\vskip 0.26cm
\begin{minted}[]{clojure}
(def kit-2
  (hear. 'x 'y
   (say. 'y 'x
    (hear. 'x 'y (nap.)))))
\end{minted}

\emph{We} know \(y\) as a free variable --- subject to substitution ---
in her immediately-next say-prefix is going to become \(z\), but
\emph{she} doesn't know so yet. She only knows that she will
\emph{eventually} know what \(y\) stands for, so \(y\) is eventually bound,
thus bound. Her bound names include \(y\) now, but \(y\) becomes free,
at least in her immediately-next say-prefix, after her first
hear-prefix is gobbled up during substitution. \(y\) might be
subject to renaming (bound) in later activities if she has a big
suffix.

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names kit-2)
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}


Kitten Two's final activity is to listen on \(x\) for
whatever-\(y\)-becomes. In that final activity, in isolation, she
doesn't know whether she will ever know \(x\), so the free variables
--- subject to substitution --- of that final activity had better
include \(x\).

\vskip 0.26cm
\begin{minted}[]{clojure}
(do (def kit-2-final (hear. 'x 'y (nap.)))
    (free-names kit-2-final))
\end{minted}

\begin{verbatim}
#{x}
\end{verbatim}


By nap-time, she'll know what \(y\) stands for, but she won't use it
while napping; \(y\) is eventually bound thus bound. We saw it's not
free; check that it's bound:

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names kit-2-final)
\end{minted}

\begin{verbatim}
#{y}
\end{verbatim}


In her next-to-last activity, which includes her last activity,
she will know what \(y\) is, so it is bound:

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names
 (say. 'y 'x
  kit-2-final))
\end{minted}

\begin{verbatim}
#{y}
\end{verbatim}


For her whole sailorly mission-plan, Kitten Two will hear \(y\) on
\(x\), so it's bound, at least until free --- subject to
substitution.

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names
 (hear. 'x 'y
  (say. 'y 'x
   (hear. 'x 'y (nap.)))))
\end{minted}

\begin{verbatim}
#{y}
\end{verbatim}


But she'll never use \(x\). She just passes \(x\) along, so it's free:

\vskip 0.26cm
\begin{minted}[]{clojure}
(free-names kit-2)
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}

\subsection{Kit-3}
\label{sec:org11f3c3e}

Kitten Three listens on \(z\) for \(v\) --- a temporary name --- then
says ``\(v\)'' on \(v\)

\vskip 0.26cm
\begin{minted}[]{clojure}
(def kit-3
  (hear. 'z 'v
   (say. 'v 'v (nap.))))
\end{minted}

Her bound names include \(v\), at least until it becomes free after
renaming (which does nothing, here) and before substitution:

\vskip 0.26cm
\begin{minted}[]{clojure}
(bound-names kit-3)
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}


Her free names --- subject to substitution --- include \(z\):

\vskip 0.26cm
\begin{minted}[]{clojure}
(free-names kit-3)
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}


Can you write down the free and bound names in her last activity,
\texttt{(say 'v 'v)}? Here are spoilers:

\vskip 0.26cm
\begin{minted}[]{clojure}
(let [kit-3-last (say. 'v 'v (nap.))]
  (println (free-names kit-3-last))
  (println (bound-names kit-3-last)))
\end{minted}

\begin{verbatim}
#{v}
#{}
\end{verbatim}

\subsection{Kitten Zero --- the Whisper Boat}
\label{sec:org08d970e}

The bound names of Kitten Zero, captain of the Whisper Boat,
include all the bound names of the other kittens, so had better be
\(x\) for her own, \(y\) from Kitten Two, and \(v\) from kitten Three:

\vskip 0.26cm
\begin{minted}[]{clojure}
(do (def whisper-boat
      (channel. 'x
                (par. kit-1
                      (par. kit-2 kit-3))))
    (bound-names whisper-boat))
\end{minted}

\begin{verbatim}
class clojure.lang.Compiler$CompilerException
\end{verbatim}


Can you writ out her free names? Here is a spoiler:

\vskip 0.26cm
\begin{minted}[]{clojure}
(free-names whisper-boat)
\end{minted}

\begin{verbatim}
class java.lang.IllegalArgumentException
\end{verbatim}


The free names --- subject to substitution --- include only \(z\)
from both Kitten One, who barks them out in \texttt{(say. 'x 'z)}, and
Kitten Three, who listens on \(z\) for a substitution:

\begin{verbatim}
#{z}
\end{verbatim}

\section{Change Log}
\label{sec:org8b24e62}

2023-26-Mar :: Current version.

2023-22-Mar :: Start.
\end{document}